${message},${name}
你好,${username}
-----------------------------------------------------
javabean测试：
你好,${user.name},今天你很精神
${user2.name}来自${user2.address.city},哪里好玩吗
------------------------------------------------------
list测试：
${list[0].city}
${list[1].city}
${list[2].city}
------------------------------------------------------
普通标量测试：
<#-- 注释符号  -->
<#if num0==18>18,成年了</#if>
<#if username=="小明">欢迎你</#if>
<#if b2>b2是true!</#if>
${date1?string("yyyy-MM-dd HH:mm:ss")}
<#-- ${date1.toString()}????时间怎么处理??  -->
------------------------------------------------------
內建函数：
${htm2?html}
------------------------------------------------------
测试空值：
<#-- ${sss} 没有定义这个变量，会报异常！ -->
<#--没有定义这个变量，默认值是空字符串！ -->
${sss!}
<#--  没有定义这个变量，默认值是abc字符串！  -->
${sss!"abc"}
-----------------------------------------------------
if语句测试：
${username}是<#if username="小明">我们的好兄弟</#if>
------------------------------------------------------
if else语句测试：
<#--不是使用>，大部分时候，freemarker会把>解释成标签结束！ -->
<#if num0 gt 18>
及格
<#else>
不及格
</#if>
-----------------------------------------------------------
if elseif else语句测试：
<#if random gte 90>
优秀
<#elseif random gte 80>
良好
<#else>
一般
</#if>
--------------------------------------------------------------
list测试：
<#list list as dizhi>
	<b>dizhi</b><br/>
</#list>
--------------------------------------------------------------
include指令测试：
<#include "included.txt" />
--------------------------------------------------------------
宏指令：
<#--定义指令m1 -->
<#macro m1>   
	<b>aaabbbccc</b>
	<b>dddeeefff</b>
</#macro>

<#--调用上面的宏指令 -->
<@m1 />
<@m1 />  

<#macro m2 a b c >
	${a}--${b}--${c}
</#macro>
<@m2 a="小明" b="小红" c="小兵" />
-------------------------------------------------------------------
表格嵌套测试:
<#macro border>
<table border=4 cellspacing=0 cellpadding=4>
	<tr>
		<td><#nested></td>
	</tr>
</table>
</#macro>
<@border>表格中内容</@border>
--------------------------------------------------------------------------
命名空间测试：
<#import "test2.ftl" as bb />
<@bb.copyright date="2013-2017" />
${bb.mail}
<#assign mail="my@163.com"  />
${mail}
<#assign mail="my@163.com" in bb  />
${bb.mail}













